In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [3]:
df = pd.read_csv("../data/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,1,Passenger_1,male,44.8,4,1,78.93,S
1,2,1,3,Passenger_2,male,38.6,1,4,60.88,Q
2,3,1,3,Passenger_3,female,39.6,3,3,15.95,S
3,4,0,3,Passenger_4,male,10.9,2,3,1.81,S
4,5,0,3,Passenger_5,male,47.0,0,4,20.68,S

In [4]:
# Drop Irrelevant Columns
df = df.drop(columns=['PassengerId', 'Name', 'Ticket', 'Cabin'], errors='ignore')
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch   Fare Embarked
0         0       1    male  44.8      4      1  78.93        S
1         1       3    male  38.6      1      4  60.88        Q
2         1       3  female  39.6      3      3  15.95        S
3         0       3    male  10.9      2      3   1.81        S
4         0       3    male  47.0      0      4  20.68        S

In [9]:
# Handle Missing Values
# Fill missing Age with mean
df['Age'] = df['Age'].fillna(df['Age'].mean())

# Fill missing Fare with median
df['Fare'] = df['Fare'].fillna(df['Fare'].median())

# Fill missing Embarked with mode
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

In [8]:
df.isnull().sum()

Survived     0
Pclass       0
Sex         49
Age          0
SibSp        0
Parch        0
Fare         0
Embarked     0
dtype: int64

In [11]:
# Encode Categorical Columns
le_sex = LabelEncoder()
df['Sex'] = le_sex.fit_transform(df['Sex'])

le_embarked = LabelEncoder()
df['Embarked'] = le_embarked.fit_transform(df['Embarked'])

df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch   Fare  Embarked
0         0       1    2  44.8      4      1  78.93         2
1         1       3    2  38.6      1      4  60.88         1
2         1       3    1  39.6      3      3  15.95         2
3         0       3    2  10.9      2      3   1.81         2
4         0       3    2  47.0      0      4  20.68         2

In [13]:
# Save the cleaned dataset
df.to_csv("../data/titanic_cleaned.csv", index=False)
print("Dataset cleaned, categorical columns encoded, and saved as titanic_cleaned.csv")

Dataset cleaned, categorical columns encoded, and saved as titanic_cleaned.csv